src/Documents/ЗаявкаНаРасходованиеСредств/ЗаявкаНаРасходованиеСредств.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЗаявкаНаРасходованиеСредств</name>
  <basedOn>Document.БюджетнаяОперация</basedOn>
  <basedOn>Document.ПоступлениеТоваровУслуг</basedOn>
  <basedOn>Document.ЗаказПоставщику</basedOn>
  <basedOn>Document.ПоступлениеДопРасходов</basedOn>
  <basedOn>Document.ВозвратТоваровОтПокупателя</basedOn>
  <basedOn>Document.ОтчетКомитентуОПродажах</basedOn>
  <basedOn>Document.АвансовыйОтчет</basedOn>
  <basedOn>Document.ДоговорЗаймаСРаботником</basedOn>
  <basedOn>Document.СчетНаОплатуПоставщика</basedOn>
  <basedOn>Document.ПоступлениеТоваровУслугВНТТ</basedOn>
  <basedOn>Document.ЗарплатаКВыплатеОрганизаций</basedOn>
  <registerRecords>AccumulationRegister.ЗаявкиНаРасходованиеСредств</registerRecords>
  <registerRecords>AccumulationRegister.РазмещениеЗаявокНаРасходованиеСредств</registerRecords>
  <registerRecords>AccumulationRegister.РасчетыСКонтрагентами</registerRecords>
  <registerRecords>AccumulationRegister.КонтролируемыеЗначенияБюджетов</registerRecords>
  <registerRecords>AccumulationRegister.ДенежныеСредстваВРезерве</registerRecords>
  <attributes>
    <name>ВидОперации</name>
    <type>
      <types>EnumRef.ВидыОперацийЗаявкиНаРасходование</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаРасхода</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Получатель</name>
    <comment>Подотчетник, касса ККМ</comment>
    <type>
      <types>CatalogRef.КассыККМ</types>
      <types>CatalogRef.ФизическиеЛица</types>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.ОтчетКомитентуОПродажах</types>
      <types>DocumentRef.СчетНаОплатуПоставщика</types>
      <types>DocumentRef.ПоступлениеТоваровУслугВНТТ</types>
      <types>DocumentRef.ЗаказПоставщику</types>
      <types>DocumentRef.ПоступлениеДопРасходов</types>
      <types>DocumentRef.ПрочиеЗатраты</types>
      <types>DocumentRef.ПоступлениеТоваровУслуг</types>
      <types>DocumentRef.ДоговорЗаймаСРаботником</types>
      <types>DocumentRef.ВозвратТоваровОтПокупателя</types>
      <types>DocumentRef.БюджетнаяОперация</types>
      <types>DocumentRef.АвансовыйОтчет</types>
    </type>
  </attributes>
  <attributes>
    <name>ФормаОплаты</name>
    <type>
      <types>EnumRef.ВидыДенежныхСредств</types>
    </type>
  </attributes>
  <attributes>
    <name>БанковскийСчетКасса</name>
    <comment>Р/с, касса </comment>
    <type>
      <types>CatalogRef.БанковскиеСчета</types>
      <types>CatalogRef.Кассы</types>
    </type>
  </attributes>
  <attributes>
    <name>ВалютаДокумента</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>КурсДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КратностьДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВалютаВзаиморасчетовПодотчетника</name>
    <comment>Валюта, в которой подотчетник должен отчитаться за истраченные деньги</comment>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>РасчетныйДокумент</name>
    <type>
      <types>DocumentRef.ДоговорЗаймаСРаботником</types>
      <types>DocumentRef.АвансовыйОтчет</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПогашенияАванса</name>
    <comment>(Упр) срок погашения аванса подотчетником</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Сценарий</name>
    <type>
      <types>CatalogRef.СценарииПланирования</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатьяОборотов</name>
    <type>
      <types>CatalogRef.СтатьиОборотовПоБюджетам</types>
    </type>
  </attributes>
  <attributes>
    <name>ЦФО</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.НоменклатурныеГруппы</types>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>Состояние</name>
    <type>
      <types>EnumRef.СостоянияОбъектов</types>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <comment>Любая дополнительная информация</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>АвтоРезервированиеПоЗаявке</name>
    <comment>(Упр)</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>АвтоРазмещениеПоЗаявке</name>
    <comment>(Упр)</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВключатьВПлатежныйКалендарь</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидВыдачиДенежныхСредств</name>
    <type>
      <types>EnumRef.ВидВыдачиДенежныхСредств</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗарплатнаяВедомость</name>
    <type>
      <types>DocumentRef.ЗарплатаКВыплатеОрганизаций</types>
    </type>
  </attributes>
  <tabularSections>
    <name>РасшифровкаПлатежа</name>
    <attributes>
      <name>ДоговорКонтрагента</name>
      <type>
        <types>CatalogRef.ДоговорыКонтрагентов</types>
      </type>
    </attributes>
    <attributes>
      <name>Сделка</name>
      <type>
        <types>DocumentRef.СчетНаОплатуПоставщика</types>
        <types>DocumentRef.ЗаказПоставщику</types>
        <types>DocumentRef.ЗаказПокупателя</types>
        <types>DocumentRef.СчетНаОплатуПокупателю</types>
      </type>
    </attributes>
    <attributes>
      <name>КурсВзаиморасчетов</name>
      <comment>Курс валюты взаиморасчетов по договору или валюты взаиморасчетов с подотчетником</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>4</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаПлатежа</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КратностьВзаиморасчетов</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаВзаиморасчетов</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтатьяДвиженияДенежныхСредств</name>
      <type>
        <types>CatalogRef.СтатьиДвиженияДенежныхСредств</types>
      </type>
    </attributes>
    <attributes>
      <name>Проект</name>
      <type>
        <types>CatalogRef.Проекты</types>
        <types>CatalogRef.ВидыРаспределенияПоПроектам</types>
      </type>
    </attributes>
    <attributes>
      <name>ДокументРасчетовСКонтрагентом</name>
      <type>
        <types>DocumentRef.ОтчетКомитентуОПродажах</types>
        <types>DocumentRef.АктОбОказанииПроизводственныхУслуг</types>
        <types>DocumentRef.ПлатежноеТребованиеПоручениеПолученное</types>
        <types>DocumentRef.ПоступлениеТоваровУслугВНТТ</types>
        <types>DocumentRef.ПлатежноеТребованиеПоручениеВыставленное</types>
        <types>DocumentRef.АккредитивПолученный</types>
        <types>DocumentRef.РеализацияУслугПоПереработке</types>
        <types>DocumentRef.ПлатежноеПоручениеВходящее</types>
        <types>DocumentRef.ВозвратТоваровПоставщику</types>
        <types>DocumentRef.КорректировкаДолга</types>
        <types>DocumentRef.ПлатежноеТребованиеПолученное</types>
        <types>DocumentRef.ПоступлениеДопРасходов</types>
        <types>DocumentRef.РасходныйКассовыйОрдер</types>
        <types>DocumentRef.АккредитивПереданный</types>
        <types>DocumentRef.РеализацияТоваровУслуг</types>
        <types>DocumentRef.КорректировкаДолгаПоВозвратнойТаре</types>
        <types>DocumentRef.ПоступлениеТоваровУслуг</types>
        <types>DocumentRef.ПередачаОС</types>
        <types>DocumentRef.ВозвратТоваровПоставщикуИзНТТ</types>
        <types>DocumentRef.ПриходныйКассовыйОрдер</types>
        <types>DocumentRef.ПлатежныйОрдерСписаниеДенежныхСредств</types>
        <types>DocumentRef.ВозвратТоваровОтПокупателя</types>
        <types>DocumentRef.ОтчетКомиссионераОПродажах</types>
        <types>DocumentRef.ПлатежноеТребованиеВыставленное</types>
        <types>DocumentRef.ПлатежныйОрдерПоступлениеДенежныхСредств</types>
        <types>DocumentRef.ПлатежноеПоручениеИсходящее</types>
        <types>DocumentRef.АвансовыйОтчет</types>
        <types>DocumentRef.ПолучениеУслугПоПереработке</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>РазмещениеЗаявки</name>
    <attributes>
      <name>МестоРазмещения</name>
      <type>
        <types>CatalogRef.БанковскиеСчета</types>
        <types>CatalogRef.Кассы</types>
        <types>DocumentRef.ПланируемоеПоступлениеДенежныхСредств</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаПлатежа</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/Enums/ВидыДенежныхСредств/ВидыДенежныхСредств.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыДенежныхСредств</name>
  <comment>(Упр)</comment>
  <enumValues>
    <name>Наличные</name>
  </enumValues>
  <enumValues>
    <name>Безналичные</name>
  </enumValues>
</mdclass:Enum>

src/Enums/ВидыОперацийЗаявкиНаРасходование/ВидыОперацийЗаявкиНаРасходование.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыОперацийЗаявкиНаРасходование</name>
  <comment>(Упр)</comment>
  <enumValues>
    <name>ОплатаПоставщику</name>
  </enumValues>
  <enumValues>
    <name>ВозвратДенежныхСредствПокупателю</name>
  </enumValues>
  <enumValues>
    <name>ВыдачаДенежныхСредствПодотчетнику</name>
  </enumValues>
  <enumValues>
    <name>ВыдачаДенежныхСредствКассеККМ</name>
  </enumValues>
  <enumValues>
    <name>РасчетыПоКредитамИЗаймамСКонтрагентами</name>
  </enumValues>
  <enumValues>
    <name>РасчетыПоКредитамИЗаймамСРаботниками</name>
  </enumValues>
  <enumValues>
    <name>ПеречислениеНалога</name>
    <comment>(Общ)</comment>
  </enumValues>
  <enumValues>
    <name>ПеречислениеЗП</name>
    <comment>(Общ)</comment>
  </enumValues>
  <enumValues>
    <name>ПрочийРасходДенежныхСредств</name>
  </enumValues>
  <enumValues>
    <name>ПрочиеРасчетыСКонтрагентами</name>
  </enumValues>
</mdclass:Enum>

src/Documents/ЗаявкаНаРасходованиеСредств/Forms/РасчетыСПодотчетнымиЛицами/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// ОСНОВНЫЕ РЕКВИЗИТЫ

// Процедура устанавливает курс документа
//
&НаСервере
Процедура УстановитьКурсДокумента()

	ДатаКурса = ?(Объект.ДатаРасхода = '00010101', Объект.Дата, Объект.ДатаРасхода);
	СтруктураКурсаВалюта       = МодульВалютногоУчета.ПолучитьКурсВалюты(Объект.ВалютаДокумента, ДатаКурса);
	Объект.КурсДокумента       = СтруктураКурсаВалюта.Курс;
	Объект.КратностьДокумента  = СтруктураКурсаВалюта.Кратность;
	
КонецПроцедуры //

// В процедуре пересчитывается курс валюты документа
//
&НаКлиенте
Процедура ПриИзмененииВалютыДокумента()

	Если Объект.ВалютаДокумента = СтараяВалютаДокумента Тогда
		Возврат;
	КонецЕсли;
	
	Если Объект.ВалютаДокумента.Пустая() Тогда
		Объект.БанковскийСчетКасса = Неопределено;
		Объект.ВключатьВПлатежныйКалендарь = Ложь;
		Объект.КурсДокумента = 0;
		Объект.КратностьДокумента = 0;
	Иначе
		УстановитьКурсДокумента();
	КонецЕсли;	
	
	СтараяВалютаДокумента = Объект.ВалютаДокумента;
	
КонецПроцедуры //

// Процедура устанавливает, что можно выбрать кассу или банковский счет
// В зависимости от формы оплаты
//
&НаКлиенте
Процедура ОграничитьВыборСчетаКассы()

	Если Объект.ФормаОплаты = ВидыДенежныхСредствБезналичные Тогда
		Элементы.БанковскийСчетКасса.ОграничениеТипа = Новый ОписаниеТипов("СправочникСсылка.БанковскиеСчета");
	ИначеЕсли Объект.ФормаОплаты = ВидыДенежныхСредствНаличные Тогда
		Элементы.БанковскийСчетКасса.ОграничениеТипа = Новый ОписаниеТипов("СправочникСсылка.Кассы");
	Иначе
		Элементы.БанковскийСчетКасса.ОграничениеТипа = Новый ОписаниеТипов;
	КонецЕсли;
	
КонецПроцедуры //

// Определяет доступность валюты документа
// Валюта недоступна, если выбрана касса или банковский счет
//
&НаКлиенте
Процедура УстановитьДоступностьВалютыДокумента()

	Если Объект.БанковскийСчетКасса = Неопределено ИЛИ Объект.БанковскийСчетКасса.Пустая() Тогда
		Элементы.ВалютаДокумента.Доступность = Истина;
	Иначе
		Элементы.ВалютаДокумента.Доступность = Ложь;
	КонецЕсли; 
	
КонецПроцедуры //

// Процедура изменяет валюту документа исходя из выбранной кассы или банковского счета
//
&НаСервере
Процедура ПолучитьВалютуБанковскогоСчетаИлиКассы()

	Объект.ВалютаДокумента = Объект.БанковскийСчетКасса.ВалютаДенежныхСредств;
	
КонецПроцедуры //
 
// Обработчик события "ПриИзменении" поля "Дата"
//
&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	
	Если НЕ ЗначениеЗаполнено(Объект.ДатаРасхода) И НЕ Объект.ВалютаДокумента.Пустая() Тогда
		УстановитьКурсДокумента();
	КонецЕсли;
	
КонецПроцедуры

// Обработчик события "ПриИзменении" поля "ДатаРасхода"
//
&НаКлиенте
Процедура ДатаРасходаПриИзменении(Элемент)
	
	Если ЗначениеЗаполнено(Объект.ДатаРасхода) И НЕ Объект.ВалютаДокумента.Пустая() Тогда
		УстановитьКурсДокумента();
	КонецЕсли;
	
КонецПроцедуры

// Обработчик события "ПриИзменении" поля "ВалютаДокумента"
//
&НаКлиенте
Процедура ВалютаДокументаПриИзменении(Элемент)
	
	ПриИзмененииВалютыДокумента();
	
КонецПроцедуры

// Обработчик события "ПриИзменении" поля "ФормаОплаты"
//
&НаКлиенте
Процедура ФормаОплатыПриИзменении(Элемент)
	
	Объект.БанковскийСчетКасса = Неопределено;
	
	ОграничитьВыборСчетаКассы();
	
	УстановитьДоступностьВалютыДокумента();	
	
КонецПроцедуры

// Обработчик события "ПриИзменении" поля "БанковскийСчетКасса"
//
&НаКлиенте
Процедура БанковскийСчетКассаПриИзменении(Элемент)
	
	Если НЕ Объект.БанковскийСчетКасса.Пустая() Тогда
		ПолучитьВалютуБанковскогоСчетаИлиКассы();
		ПриИзмененииВалютыДокумента();
	КонецЕсли;
	
	Объект.РазмещениеЗаявки.Очистить();
	
	УстановитьДоступностьВалютыДокумента();	
	
КонецПроцедуры

// Обработчик события "ПриИзменении" поля "Организация"
//
&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	
	Если НЕ ПустаяСтрока(Объект.Номер) Тогда
		ПрефиксацияОбъектовСобытия.ОчиститьНомерОбъекта(Объект.Номер, Объект.Организация);
	КонецЕсли; 
	
КонецПроцедуры


////////////////////////////////////////////////////////////////////////////////
// ФОРМА

// Процедура заполняет реквизиты формы по данным первой строки ТЧ "РасшифровкаПлатежа"
//
&НаСервере
Процедура ЗаполнитьДанныеФормы()

	Если Объект.РасшифровкаПлатежа.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	СтрокаПлатеж = Объект.РасшифровкаПлатежа.Получить(0);
	
	СуммаПлатежа                  = СтрокаПлатеж.СуммаПлатежа;
	СтатьяДвиженияДенежныхСредств = СтрокаПлатеж.СтатьяДвиженияДенежныхСредств;
	
КонецПроцедуры //

// В процедуре инициализируются значения констант формы
// Константы используются при выполнении модуля формы
//
&НаСервере
Процедура УстановитьЗначенияКонстантФормы()
	
	ВидыДенежныхСредствБезналичные = Перечисления.ВидыДенежныхСредств.Безналичные;
	ВидыДенежныхСредствНаличные    = Перечисления.ВидыДенежныхСредств.Наличные;
	
КонецПроцедуры //

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УстановитьЗначенияКонстантФормы();
	
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		
		// Это существующий документ. 
		// Проверим, что его можно менять.
		НастройкаПравДоступа.ОпределитьДоступностьВозможностьИзмененияДокументаПоДатеЗапрета(РеквизитФормыВЗначение("Объект"), ЭтаФорма);
		
		//Если используется функционал согласования заявок - проверим можно ли редактировать заявку
		Если НЕ ТолькоПросмотр Тогда
			ТолькоПросмотр = НЕ УправлениеДенежнымиСредствами.РазрешеноИзменениеЗаявки(Объект.Ссылка);
		КонецЕсли;
		
	Иначе
		
		Если Параметры.Свойство("КопируемыйОбъект") Тогда
			// Форма создается программно, при этом выполняется копирование
			ДокументОбъект = РеквизитФормыВЗначение("Объект");
			ЗаполнитьЗначенияСвойств(ДокументОбъект, Параметры.КопируемыйОбъект,, "Номер,Дата,ПометкаУдаления,Проведен,Ответственный,Состояние,АвтоРезервированиеПоЗаявке,АвтоРазмещениеПоЗаявке");
			ДокументОбъект.РасшифровкаПлатежа.Загрузить(Параметры.КопируемыйОбъект.РасшифровкаПлатежа.Выгрузить());
			
			ЗначениеВРеквизитФормы(ДокументОбъект, "Объект");
		КонецЕсли;
		
		Объект.ВидОперации = Перечисления.ВидыОперацийЗаявкиНаРасходование.ВыдачаДенежныхСредствПодотчетнику;
		
	КонецЕсли;
	
	Элементы.Получатель.ОграничениеТипа = Новый ОписаниеТипов("СправочникСсылка.ФизическиеЛица");
	
	ЗаполнитьДанныеФормы();
	
	СтараяВалютаДокумента = Объект.ВалютаДокумента;	
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Объект.ВалютаВзаиморасчетовПодотчетника = Объект.ВалютаДокумента;
	Объект.СуммаДокумента = СуммаПлатежа;
	
	// Сформируем расшифровку платежа по данным документа
	Объект.РасшифровкаПлатежа.Очистить();
	
	СтрокаПлатеж = Объект.РасшифровкаПлатежа.Добавить();
	СтрокаПлатеж.СуммаПлатежа                  = СуммаПлатежа;
	СтрокаПлатеж.СуммаВзаиморасчетов           = СуммаПлатежа;
	СтрокаПлатеж.СтатьяДвиженияДенежныхСредств = СтатьяДвиженияДенежныхСредств;
	СтрокаПлатеж.КурсВзаиморасчетов            = Объект.КурсДокумента;
	СтрокаПлатеж.КратностьВзаиморасчетов       = Объект.КратностьДокумента;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ОграничитьВыборСчетаКассы();
	УстановитьДоступностьВалютыДокумента();
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	ПроверяемыеРеквизиты.Добавить("СуммаПлатежа");
	
КонецПроцедуры
